src/gena/transgen-mg-UAH-1304-4.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <RegisterOperation xmlns="http://www.ukrgasbank.com">
            <TransferId>47816676</TransferId>
            <TransferNumber>65091948</TransferNumber>
            <SystemCode>mg</SystemCode>
            <SystemName>MoneyGram</SystemName>
            <Operation>2</Operation>
            <Type>1</Type>
            <OperationDate>2021-04-13T10:16:44+03:00</OperationDate>
            <PayoutDate>2021-04-13T10:15:39+03:00</PayoutDate>
            <OperationCashDesk>0</OperationCashDesk>
            <ABSDate>2021-04-13T00:00:00+03:00</ABSDate>
            <TransferAmount>2123.70</TransferAmount>
            <FromCountry>616</FromCountry>
            <ToCountry>804</ToCountry>
            <TransferСurrency>980</TransferСurrency>
            <PointBank>1000148</PointBank>
            <PointSW>GASB0005</PointSW>
            <UserLogin>vleshchenko</UserLogin>
            <UserName>Лещенко Валентина Вікторівна</UserName>
            <UserID>12629</UserID>
            <Sender>
                <LastName>PROKOPENKO</LastName>
                <FirstName>OLEH</FirstName>
            </Sender>
            <Receiver>
                <LastName>KYSLYTSYA</LastName>
                <FirstName>IRYNA</FirstName>
                <Residency>true</Residency>
                <DocumentName>Паспорт</DocumentName>
                <DocumentSeries>HC</DocumentSeries>
                <DocumentNumber>056657</DocumentNumber>
                <DocumentIssueDate>1995-12-26</DocumentIssueDate>
                <DocumentIssuedBy>UMANSKIM MV UMVS UKRAINI V CHERKASKIY OBL</DocumentIssuedBy>
                <DateofBirth>1978-08-17</DateofBirth>
            </Receiver>
        </RegisterOperation>
    </soap:Body>
</soap:Envelope>
